; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph4 - mode
	spectrograph5 - mode
	infrared8 - mode
	spectrograph3 - mode
	image0 - mode
	infrared7 - mode
	infrared2 - mode
	thermograph1 - mode
	spectrograph6 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star5 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared7)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph5)
	(supports instrument2 image0)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared7)
	(supports instrument3 image0)
	(supports instrument3 spectrograph6)
	(supports instrument3 infrared8)
	(calibration_target instrument3 Star5)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared7)
	(supports instrument4 image0)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(have_image Phenomenon8 spectrograph5)
	(have_image Star9 infrared2)
	(have_image Star9 infrared8)
	(have_image Star9 infrared7)
	(have_image Planet10 spectrograph5)
	(have_image Planet10 spectrograph4)
	(have_image Planet11 spectrograph4)
	(have_image Planet11 thermograph1)
	(have_image Planet11 spectrograph6)
	(have_image Star12 infrared8)
	(have_image Star12 spectrograph5)
	(have_image Star12 infrared7)
))

)

; plan
1. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite1 planet11 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet11)
   goals met: 0 of 12
5. (take_image satellite1 planet11 instrument3 spectrograph6)
   added: (have_image planet11 spectrograph6)
   goals met: 1 of 12
6. (take_image satellite1 planet11 instrument3 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 2 of 12
7. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 2 of 12
8. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 12
9. (take_image satellite1 planet10 instrument3 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 3 of 12
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 12
11. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 12
12. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 3 of 12
13. (take_image satellite0 star9 instrument1 infrared2)
   added: (have_image star9 infrared2)
   goals met: 4 of 12
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 12
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 12
16. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 4 of 12
17. (calibrate satellite0 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 4 of 12
18. (turn_to satellite0 phenomenon8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 12
19. (take_image satellite0 phenomenon8 instrument2 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 5 of 12
20. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 5 of 12
21. (take_image satellite0 planet10 instrument2 spectrograph5)
   added: (have_image planet10 spectrograph5)
   goals met: 6 of 12
22. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 6 of 12
23. (take_image satellite0 planet11 instrument2 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 7 of 12
24. (turn_to satellite0 star12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star12)
   goals met: 7 of 12
25. (take_image satellite0 star12 instrument2 spectrograph5)
   added: (have_image star12 spectrograph5)
   goals met: 8 of 12
26. (turn_to satellite1 star12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star12)
   goals met: 8 of 12
27. (take_image satellite1 star12 instrument3 infrared7)
   added: (have_image star12 infrared7)
   goals met: 9 of 12
28. (take_image satellite1 star12 instrument3 infrared8)
   added: (have_image star12 infrared8)
   goals met: 10 of 12
29. (turn_to satellite1 star9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
30. (take_image satellite1 star9 instrument3 infrared7)
   added: (have_image star9 infrared7)
   goals met: 11 of 12
31. (take_image satellite1 star9 instrument3 infrared8)
   added: (have_image star9 infrared8)
   goals met: 12 of 12
